app/controllers/heros_controller.rb

  def index
    @heros = Hero.all
    puts 'HeroController'
    for hero in @heros do
      hero.links = Link.find(hero.hero_links)
      hero.attrs = Attr.find(hero.hero_attributes)
      hero.relationshipsObj = Relationship.find(hero.relationships)
---
SELECT "heros".* FROM "heros"
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
SELECT  "attrs".* FROM "attrs" WHERE "attrs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]